In [2]:
import pandas as pd
data = [[11, 21, 31], [43, 54, 66], [59, 60, 78], [90, 91, 92]]
 
s = pd.Series(data)
print(s)

0    [11, 21, 31]
1    [43, 54, 66]
2    [59, 60, 78]
3    [90, 91, 92]
dtype: object

In [4]:
import pandas as pd
date=pd.date_range(start='05.01.2021',end='05.12.2021')
print(date)

DatetimeIndex(['2021-05-01', '2021-05-02', '2021-05-03', '2021-05-04',
               '2021-05-05', '2021-05-06', '2021-05-07', '2021-05-08',
               '2021-05-09', '2021-05-10', '2021-05-11', '2021-05-12'],
              dtype='datetime64[ns]', freq='D')

In [9]:
import pandas as pd
details= {
    'Name' : ['Sruthi', 'Aishwarya', 'Shaurya', 'Shivangi'],
    'Age' : [23, 21, 22, 21],
    'University' : ['BHU', 'JNU', 'DU', 'BHU']
}
df = pd.DataFrame(details)
print(df)

        Name  Age University
0     Sruthi   23        BHU
1  Aishwarya   21        JNU
2    Shaurya   22         DU
3   Shivangi   21        BHU

In [14]:
import pandas as pd

data = [['New York Yankees', 'Acevedo Juan', 900000, 'Pitcher'], 
        ['New York Yankees', 'Anderson Jason', 300000, 'Pitcher'], 
        ['New York Yankees', 'Clemens Roger', 10100000, 'Pitcher'], 
        ['New York Yankees', 'Contreras Jose', 5500000, 'Pitcher']]

df = pd.DataFrame.from_records(data)
print(df)

                  0               1         2        3
0  New York Yankees    Acevedo Juan    900000  Pitcher
1  New York Yankees  Anderson Jason    300000  Pitcher
2  New York Yankees   Clemens Roger  10100000  Pitcher
3  New York Yankees  Contreras Jose   5500000  Pitcher

In [17]:
import pandas as pdf
df=pd.read_csv('ex_4.csv')
print(df)

      Waterfalls        District
0     soochipara          idukki
1      anchuruli         kottyam
2  aanayadikuthu  pathanamthitta

In [21]:
import pandas as pd
details= {
    'Name' : ['Sruthi', 'Sindhya', 'Subadra', 'MEGHA'],
    'Age' : [23, 22, 21, 20],
    'University' : ['ku', 'ktu', 'cusat', 'mg']
}
df = pd.DataFrame(details)
print(df)
print('SORTED DATAFRAME')
print(df.sort_values(by=['Age'], ascending=True))

      Name  Age University
0   Sruthi   23         ku
1  Sindhya   22        ktu
2  Subadra   21      cusat
3    MEGHA   20         mg
SORTED DATAFRAME
      Name  Age University
3    MEGHA   20         mg
2  Subadra   21      cusat
1  Sindhya   22        ktu
0   Sruthi   23         ku

In [2]:
import pandas as pd
details= {
    'Name' : ['Sruthi', 'Sindhya', 'Subadra', 'MEGHA'],
    'Age' : [23, 22, 21, 20],
    'University' : ['ku', 'ktu', 'cusat', 'mg']
}
index = {'a', 'b', 'c', 'd'}
df = pd.DataFrame(details, index)
df.reset_index(inplace = True)
print(df)

  index     Name  Age University
0     c   Sruthi   23         ku
1     b  Sindhya   22        ktu
2     a  Subadra   21      cusat
3     d    MEGHA   20         mg

In [32]:
import pandas as pd
details= {
    'Name' : ['Sruthi', 'Sindhya', 'Subadra', 'MEGHA'],
    'Age' : [23, 22, 21, 20],
    'University' : ['ku', 'ktu', 'cusat', 'mg']
}
df=pd.DataFrame(details)
df1 = df.head(2)
print(df1)

      Name  Age University
0   Sruthi   23         ku
1  Sindhya   22        ktu

In [37]:
import pandas as pd
data= {
    'Name' : ['Surya','Theertha','Vaishak','Fathima'],
    'Occupation':['Teacher','Engineer','Engineer','Teacher'],
    'Salary':[20000,34000,45000,45555]
}
df=pd.DataFrame(data)
print(df)
Salary_average= df.groupby('Occupation')['Salary'].mean() 

print(Salary_average)

       Name Occupation  Salary
0     Surya    Teacher   20000
1  Theertha   Engineer   34000
2   Vaishak   Engineer   45000
3   Fathima    Teacher   45555
Occupation
Engineer    39500.0
Teacher     32777.5
Name: Salary, dtype: float64

In [43]:
import pandas as pd
import numpy as np
data= {
    'Name' : ['Surya','Theertha','Vaishak','Fathima'],
    'Id' : [1,2,3,4],
    'Phone Number':[np.nan,90742767,673378732,np.nan]
}
df=pd.DataFrame(data)
print(df) 



df_nullfill = df.fillna(0)

print(df_nullfill)

       Name  Id  Phone Number
0     Surya   1           NaN
1  Theertha   2    90742767.0
2   Vaishak   3   673378732.0
3   Fathima   4           NaN
       Name  Id  Phone Number
0     Surya   1           0.0
1  Theertha   2    90742767.0
2   Vaishak   3   673378732.0
3   Fathima   4           0.0

In [3]:
import pandas as pd
import numpy as np
data= {
    'cname' : ['Wipro','Cognizant','Mphasis','UST'],
    'profit' : [1000000,2000000,-31110,-43000]
}
df=pd.DataFrame(data)
print(df)
print()
print()
df['profit'] = df['profit'].apply(lambda x:x>0)
print(df)

       cname   profit
0      Wipro  1000000
1  Cognizant  2000000
2    Mphasis   -31110
3        UST   -43000


       cname  profit
0      Wipro    True
1  Cognizant    True
2    Mphasis   False
3        UST   False

In [4]:
import pandas as pd
import numpy as np
data1= {
    'eid' : [1001,1002,1003,1004],
    'ename' : ['Anu','Anju','Anand','Ali'],
    'stipend' : [10000,20000,13000,15000]
}
data2= {
    'eid' : [1001,1002,1003,1004],
    'designation' : ['senior manager','sales manager','manager','clerk']
}
df1=pd.DataFrame(data1)
df2=pd.DataFrame(data2)
print(df1)
print()
print()
print(df2)
print()
print()
dataframe = pd.merge(df1, df2, how = 'inner', on = 'eid')
print(dataframe)

    eid  ename  stipend
0  1001    Anu    10000
1  1002   Anju    20000
2  1003  Anand    13000
3  1004    Ali    15000


    eid     designation
0  1001  senior manager
1  1002   sales manager
2  1003         manager
3  1004           clerk


    eid  ename  stipend     designation
0  1001    Anu    10000  senior manager
1  1002   Anju    20000   sales manager
2  1003  Anand    13000         manager
3  1004    Ali    15000           clerk